//Вывести на одной строке числа 1, 13 и 49 с одним пробелом между ними.

/*Console.Write("1 13 49");
Console.Read();*/

int a = 1, b = 13, c = 49;
Console.WriteLine($"{a} {b} {c}");
