// Вывести на экран числа 50 и 10 одно под другим.
Console.WriteLine(50);
Console.WriteLine(10);