/* Вывести на экран число e (основание
натурального логарифма) с точностью до десятых*/
double e = 2.71828;
e = Math.Round(e,1);
Console.WriteLine(e);