// Составить программу вывода на экран «столбиком» четырех любых чисел
Console.WriteLine(new Random().Next(0, 10));
Console.WriteLine(new Random().Next(0, 100));
Console.WriteLine(new Random().Next(0, 1000));