//Вывести на одной строке числа 7, 15 и 100 с двумя пробелами между ними.

/*Console.Write("7  15  100");
Console.Read();*/

int a = 7, b = 15, c = 100;
Console.WriteLine($"{a}  {b}  {c}");
